app/controllers/errors_controller.rb

SELECT * FROM "errors"
---
  def index
    @errors = Error.all

SELECT * FROM "errors" WHERE ("errors"."id" = 1)
---
  def show
    @error = Error.find(params[:id])